In [6]:
import pandas as pd

In [7]:
df = pd.read_csv( "iris.csv")

In [8]:
df.sample(5)     # random 5 rows

      name  age       city        course  marks grade  attendance passed
30   Kunal   22  Bangalore       Web Dev     43     D          53     No
3    Sneha   20       Pune        Python     92    A+          95    Yes
14   Sahil   23      Delhi       Web Dev     40     D          50     No
25    Neha   21  Hyderabad  Data Science     82     A          85    Yes
11  Ishita   20  Hyderabad        Python     96    A+          98    Yes

In [9]:
print(df.info()) #print basic info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        40 non-null     object
 1   age         40 non-null     int64
 2   city        40 non-null     object
 3   course      40 non-null     object
 4   marks       40 non-null     int64
 5   grade       40 non-null     object
 6   attendance  40 non-null     int64
 7   passed      40 non-null     object
dtypes: int64(3), object(5)
memory usage: 2.6+ KB
None

In [10]:
print(df.describe()) #print descriptive statistics

             age     marks  attendance
count  40.000000  40.00000   40.000000
mean   21.600000  71.45000   77.775000
std     1.373747  19.13508   16.144361
min    20.000000  34.00000   45.000000
25%    20.000000  57.25000   67.250000
50%    21.000000  75.00000   82.500000
75%    23.000000  88.00000   90.250000
max    24.000000  97.00000   99.000000

In [11]:
print(df.shape) #print shape

(40, 8)

In [12]:
print(df.columns) #print columns

Index(['name', 'age', 'city', 'course', 'marks', 'grade', 'attendance',
       'passed'],
      dtype='object')

In [13]:
print(df.index) #print index

RangeIndex(start=0, stop=40, step=1)

In [14]:
print(df.values) #print values

[['Aarav' 20 'Mumbai' 'Python' 85 'A' 92 'Yes']
 ['Priya' 21 'Delhi' 'Data Science' 78 'B' 88 'Yes']
 ['Rohit' 22 'Bangalore' 'Web Dev' 45 'D' 60 'No']
 ['Sneha' 20 'Pune' 'Python' 92 'A+' 95 'Yes']
 ['Vikram' 23 'Hyderabad' 'AI/ML' 67 'C' 75 'Yes']
 ['Ananya' 21 'Chennai' 'Data Science' 88 'A' 90 'Yes']
 ['Arjun' 22 'Jaipur' 'Web Dev' 34 'F' 45 'No']
 ['Kavya' 20 'Mumbai' 'Python' 91 'A+' 93 'Yes']
 ['Deepak' 24 'Delhi' 'AI/ML' 72 'B' 80 'Yes']
 ['Meera' 21 'Bangalore' 'Data Science' 55 'C' 65 'No']
 ['Raj' 23 'Pune' 'Web Dev' 81 'A' 87 'Yes']
 ['Ishita' 20 'Hyderabad' 'Python' 96 'A+' 98 'Yes']
 ['Karan' 22 'Chennai' 'AI/ML' 63 'C' 70 'Yes']
 ['Pooja' 21 'Mumbai' 'Data Science' 74 'B' 82 'Yes']
 ['Sahil' 23 'Delhi' 'Web Dev' 40 'D' 50 'No']
 ['Nisha' 20 'Jaipur' 'Python' 89 'A' 91 'Yes']
 ['Aditya' 22 'Bangalore' 'AI/ML' 58 'C' 68 'No']
 ['Riya' 21 'Pune' 'Data Science' 83 'A' 86 'Yes']
 ['Manish' 24 'Hyderabad' 'Web Dev' 47 'D' 55 'No']
 ['Tanvi' 20 'Chennai' 'Python' 94 'A+' 96 'Yes']
 ['Amit' 23 'Mumbai' 'AI/ML' 76 'B' 84 'Yes']
 ['Divya' 21 'Delhi' 'Data Science' 69 'C' 73 'Yes']
 ['Rahul' 22 'Jaipur' 'Web Dev' 38 'F' 48 'No']
 ['Shruti' 20 'Bangalore' 'Python' 87 'A' 89 'Yes']
 ['Varun' 24 'Pune' 'AI/ML' 71 'B' 79 'Yes']
 ['Neha' 21 'Hyderabad' 'Data Science' 82 'A' 85 'Yes']
 ['Piyush' 22 'Ahmedabad' 'Python' 95 'A+' 97 'Yes']
 ['Simran' 20 'Chennai' 'Web Dev' 52 'C' 62 'No']
 ['Harsh' 23 'Mumbai' 'AI/ML' 66 'C' 74 'Yes']
 ['Anjali' 21 'Delhi' 'Data Science' 90 'A+' 94 'Yes']
 ['Kunal' 22 'Bangalore' 'Web Dev' 43 'D' 53 'No']
 ['Swati' 20 'Pune' 'Python' 88 'A' 90 'Yes']
 ['Nikhil' 24 'Jaipur' 'AI/ML' 61 'C' 69 'Yes']
 ['Kritika' 21 'Hyderabad' 'Data Science' 79 'B' 83 'Yes']
 ['Gaurav' 23 'Chennai' 'Web Dev' 36 'F' 47 'No']
 ['Pallavi' 20 'Mumbai' 'Python' 93 'A+' 95 'Yes']
 ['Tushar' 22 'Delhi' 'AI/ML' 70 'B' 78 'Yes']
 ['Bhavna' 21 'Bangalore' 'Data Science' 84 'A' 88 'Yes']
 ['Siddharth' 24 'Pune' 'Web Dev' 49 'D' 58 'No']
 ['Komal' 20 'Ahmedabad' 'Python' 97 'A+' 99 'Yes']]

In [15]:
print(df.dtypes) #print dtypes

name          object
age            int64
city          object
course        object
marks          int64
grade         object
attendance     int64
passed        object
dtype: object

In [16]:
print(df.head()) #first 5 rows

     name  age       city        course  marks grade  attendance passed
0   Aarav   20     Mumbai        Python     85     A          92    Yes
1   Priya   21      Delhi  Data Science     78     B          88    Yes
2   Rohit   22  Bangalore       Web Dev     45     D          60     No
3   Sneha   20       Pune        Python     92    A+          95    Yes
4  Vikram   23  Hyderabad         AI/ML     67     C          75    Yes

In [17]:
print(df.tail()) #last 5 rows

         name  age       city        course  marks grade  attendance passed
35    Pallavi   20     Mumbai        Python     93    A+          95    Yes
36     Tushar   22      Delhi         AI/ML     70     B          78    Yes
37     Bhavna   21  Bangalore  Data Science     84     A          88    Yes
38  Siddharth   24       Pune       Web Dev     49     D          58     No
39      Komal   20  Ahmedabad        Python     97    A+          99    Yes

In [18]:
print(df.describe()) #print descriptive statistics (count,mean,std,min,max,25%,50%,75%)

             age     marks  attendance
count  40.000000  40.00000   40.000000
mean   21.600000  71.45000   77.775000
std     1.373747  19.13508   16.144361
min    20.000000  34.00000   45.000000
25%    20.000000  57.25000   67.250000
50%    21.000000  75.00000   82.500000
75%    23.000000  88.00000   90.250000
max    24.000000  97.00000   99.000000

In [19]:
print(df.age.describe())

count    40.000000
mean     21.600000
std       1.373747
min      20.000000
25%      20.000000
50%      21.000000
75%      23.000000
max      24.000000
Name: age, dtype: float64

In [20]:
print(df.isnull().sum()) #print number of missing values in each column

name          0
age           0
city          0
course        0
marks         0
grade         0
attendance    0
passed        0
dtype: int64